In [2]:
import pandas as pd

data = {
    "Name": ["Rohit", "Amit", "Sneha", "Priya", "Karan"],
    "Age": [20, 21, 19, 22, 20],
    "Branch": ["CE", "IT", "CE", "ENTC", "IT"],
    "Marks": [85, 78, 92, 88, 76],
    "City": ["Pune", "Mumbai", "Pune", "Nashik", "Pune"]
}

df = pd.DataFrame(data)

In [6]:
print(df)

    Name  Age Branch  Marks    City
0  Rohit   20     CE     85    Pune
1   Amit   21     IT     78  Mumbai
2  Sneha   19     CE     92    Pune
3  Priya   22   ENTC     88  Nashik
4  Karan   20     IT     76    Pune

In [10]:
df.head(3)

    Name  Age Branch  Marks    City
0  Rohit   20     CE     85    Pune
1   Amit   21     IT     78  Mumbai
2  Sneha   19     CE     92    Pune

In [11]:
df.tail(2)

    Name  Age Branch  Marks    City
3  Priya   22   ENTC     88  Nashik
4  Karan   20     IT     76    Pune

In [14]:
df.shape

(5, 5)

In [18]:
df.columns

Index(['Name', 'Age', 'Branch', 'Marks', 'City'], dtype='object')

In [21]:
df[["Name" , "Marks" ]]

    Name  Marks
0  Rohit     85
1   Amit     78
2  Sneha     92
3  Priya     88
4  Karan     76

In [28]:
df[["Name" , "Marks"]][df["Marks"] > 80]

    Name  Marks
0  Rohit     85
2  Sneha     92
3  Priya     88

In [36]:
df.query("City == 'Pune'")

    Name  Age Branch  Marks  City
0  Rohit   20     CE     85  Pune
2  Sneha   19     CE     92  Pune
4  Karan   20     IT     76  Pune

In [44]:
df[(df["Branch"] == "IT") & (df["Marks"] > 80)]

Empty DataFrame
Columns: [Name, Age, Branch, Marks, City]
Index: []

In [56]:
df.count()

Name      5
Age       5
Branch    5
Marks     5
City      5
dtype: int64

In [57]:
df["Age"].min()

19

In [59]:
df["Branch"].count()

np.int64(5)

In [60]:
df_sorted = df.sort_values(by="Marks", ascending=False).copy()
df_sorted

    Name  Age Branch  Marks    City
2  Sneha   19     CE     92    Pune
3  Priya   22   ENTC     88  Nashik
0  Rohit   20     CE     85    Pune
1   Amit   21     IT     78  Mumbai
4  Karan   20     IT     76    Pune